{"q": ["raspberry pi", "uss carl vinson", "reviews of les miserables", "rules of golf", "average charitable donation", "wind power", "bph treatment", "doctor zhivago", "land surveyor", "golf gps", "what is madagascar known for", "home theater systems", "carpal tunnel syndrome", "capital gains tax rate", "maryland department of natural resources", "nicolas cage movies", "kids earth day activities", "solar water fountains", "what was the name of elvis presley's home", "nba records", "electoral college 2008 results", "male menopause", "usda food pyramid", "making chicken soup from scratch", "black and gold", "traverse city", "i will survive lyrics", "hawaiian volcano observatories", "beef stroganoff recipe", "world's biggest dog", "what are the seven deadly sins", "hurricane Irene flooding in manville nj", "hair dye", "dark chocolate health benefits", "ham radio", "symptoms of mad cow disease in humans", "lump in throat", "george bush sr bio", "frank lloyd wright biography", "presidential middle names", "what is a wiki", "cannellini beans", "afghanistan flag", "old town scottsdale", "roosevelt island", "civil war battles in South Carolina", "rain man", "eggs shelf life", "occupational therapist", "ford edge problems", "identifying spider bites", "history of orcas island", "tooth abscess", "barrett's esophagus", "teddy bears", "patron saint of mental illness", "holes by louis sachar", "hip roof", "carpenter bee", "the american revolutionary", "folk remedies sore throat", "balding cure", "evidence for evolution", "tribe formerly living in alabama", "F5 tornado", "symptoms of heart attack", "feliz navidad lyrics", "benefits of running", "marshall county schools", "sun tzu", "halloween activities for middle school", "dreams interpretation", "wilson's disease", "golf instruction", "uss cole", "how has african american music influence history", "bewitched cast", "mister rogers", "game theory", "view my internet history", "ketogenic diet", "nasa interplanetary missions", "hayrides in pa", "where to find morel mushrooms", "magnesium rich foods", "common schizophrenia drugs", "carotid cavernous fistula treatment", "fidel castro", "benefits of yoga", "norway spruce", "sangre de cristo mountains", "history of the electronic medical record", "educational advantages of social networking sites", "flowering plants", "how to tie a windsor knot", "recycling lead acid batteries", "altitude sickness", "medical care and jehovah's witnesses", "pink slime in ground beef", "how to find the mean"], "intention": [["What is a raspberry pi?", "What software does a raspberry pi use?", "What are hardware options for a raspberry pi?", "How much does a basic raspberry pi cost?", "Find info about the raspberry pi foundation.", "Find a picture of a raspberry pi."], ["Find the home page of the USS Carl Vinson (CVN70) carrier.", "Find lists of shipmates on the USS Carl Vinson.", "What is the mailing address for the USS Carl Vinson?", "Where can I get a cruise book for the USS Carl Vinson?", "What is the home port for the USS Carl Vinson?", "Find the home page of the USS Carl Vinson ombudsman."], ["Find movie reviews of the film \"Les Miserables\"."], ["What are the official PGA rules for golf?"], ["What is the average annual charitable donation by individuals in the USA?"], ["What are the pros and cons of using wind power.", "Find information on wind power in the USA.", "Find information on wind power companies.", "Find information on residential (home) wind power.", "Find information on how wind turbines work.", "Find pictures of wind turbines used for wind power.", "Find pictures of a wind farm."], ["What are the treatment options for BPH (benign prostatic hyperplasia)?", "Which medications are used for BPH?", "What surgical options are used to treat BPH?", "What are some lifestyle measures for managing BPH?", "What are the symptoms of BPH?", "What are the causes of BPH?", "What are the side effects of BPH treatments?"], ["What went into writing/publishing the book Doctor Zhivago?", "Find a synopsis of Doctor Zhivago.", "Who got an Academy Award nomination for Doctor Zhivago?", "Who's in the cast of the Doctor Zhivago movie?", "Who was Boris Pasternak and how did his life affect his book?", "What DVD versions of the Doctor Zhivago movie are available?"], ["Find job openings for land surveyors.", "What equipment and tools does a land surveyor use in his job?", "What education does one need to become a land surveyor?", "Which schools provide training to become a land surveyor?", "What salary range does a land surveyor receive?"], ["What is the best golf gps device?", "Compare Bushnell, Callaway and Garmin golf gps systems.", "Is there a golf gps app for the Iphone?", "Find information on handheld golf gps devices.", "Is there a golf gps system that can be used world wide?", "Where can I get a used golf gps device?"], ["What is Madagascar known for?"], ["Find information on home theater room design.", "What home theater systems does Bose offer?", "Find information about home theater receivers.", "Find information about wireless home theater systems.", "Find reviews of home theater systems."], ["What are the symptoms of carpal tunnel syndrome (CTS)?", "How is CTS treated?", "How is CTS diagnosed?", "Find the causes of CTS.", "Which exercises can bring relief from CTS?", "Which activities are prevalent among CTS sufferers?", "What are the options for surgically correcting CTS?", "What are the recovery prospects for CTS surgical patients?"], ["What does the US capital tax rate consist of and how is it broken down?"], ["Find the phone numbers for units within the Maryland Department of Natural Resources.", "How do you get a Maryland fishing license?", "What information is available about Maryland parks and recreation?", "What are the dates for Maryland hunting season?", "Find information about the Maryland Department of Natural Resources police.", "Find Maryland DNR fishing reports."], ["What movies has Nicolas Cage appeared in?", "What Nicolas Cage movies can be obtained from Netflix?", "What is the next movie Nicolas Cage will appear in?", "What was the movie Nicolas Cage appeared in that was released in 2011?"], ["What are fun activities kids can do to celebrate Earth Day?"], ["What solar water fountains are available for gardens.", "What solar water fountains are available for bird baths.", "What type of pumps are used for solar water fountains?", "Find solar water fountains for sale."], ["What was the name of Elvis Presley's home?"], ["Who are the NBA all-time record holders?", "Get details on NBA single game records.", "Who holds the NBA record for most assists?", "Who holds the NBA career scoring record?", "What NBA records does Michael Jordan hold?"], ["What were the results of the electoral college for the 2008 US presidential race?"], ["What are the symptoms and signs of male menopause?", "Find information on male menopause medication.", "What is the definition of male menopause?", "What is the medical term for male menopause?", "Find information on male menopause supplements."], ["Find a description of the USDA food pyramid."], ["Find recipes for making chicken soup."], ["Find a picture of an Air Jordan Black and Gold.", "Find Pittsburgh Steelers merchandise for sale.", "Find information about Purdue University sports program.", "Find information on Black Hills gold jewelry.", "Find information on Black Gold dog food."], ["What attractions are there in Traverse City, Michigan?", "Get information about Traverse City, Michigan real estate.", "Find information about hotels in Traverse City, Michigan.", "Find information about the Traverse City Cherry Festival.", "What is the zip code for Traverse City, Michigan?", "Find information about the Traverse City Record-Eagle."], ["Find the lyrics to the song \"I Will Survive\"."], ["I am looking for the history of and a summary of the work performed at the Hawaiian Volcano Observatories."], ["Find complete (not partial) recipes for beef stroganoff."], ["What is the world's biggest dog?"], ["Find a list of the seven deadly sins."], ["How has the flooding that resulted from hurricane Irene affected Manville, NJ?"], ["What commercial hair dyes are available?", "Find information on making homemade hair dye products.", "Where can I find organic or chemical free hair dye products?", "What hair dye options should be considered during pregnancy?", "Find reviews of hair dye removers."], ["What are the health benefits associated with eating dark chocolate?"], ["How do you get a ham radio license?", "What are the ham radio license classes?", "How do you build a ham radio station?", "Find information on ham radio antennas.", "What are the ham radio call signs?", "Find the web site of Ham Radio Outlet."], ["Find information about mad cow disease symptoms in humans."], ["Find information about a lump in the throat caused by the thyroid.", "What are some of the causes for a lump in the throat?", "What are some remedies for a lump in the throat?", "How does anxiety cause the feeling of a lump in the throat?", "Find information about difficulty in swallowing caused by a lump in the throat."], ["Find biographies of US President George H.W. Bush."], ["Find biographical information for Frank Lloyd Wright."], ["Find a list of the full names of US presidents."], ["Find information about what a wiki is."], ["Which beans can be substituted for cannellini beans?", "How do you cook dried cannellini beans?", "Find recipes using cannellini beans.", "What are the nutritional facts for cannellini beans?"], ["Find pictures of the Afghanistan flag.", "What does the Afghanistan flag's national emblem represent?", "What does the Afghanistan flag's Arabic inscription mean?", "How can I purchase an Afghanistan flag?"], ["Find restaurants in Old Town Scottsdale, AZ.", "What is the history of Old Town Scottsdale, AZ?", "Find a map of Old Town Scottsdale, AZ.", "Where is Fashion Square in Scottsdale?"], ["What restaurants are on Roosevelt Island (NY)?", "Find the Roosevelt Island tram schedule.", "What is the history of the Roosevelt Island tram?", "Find a map of Roosevelt Island (NY).", "Find real estate listings for Roosevelt Island (NY)."], ["Which civil war battles were fought in South Carolina?"], ["Where can I watch the full \"Rain Main\" movie online?", "Find information about the real person on which the Rain Man movie is based.", "Find movie reviews of \"Rain Man\".", "Find quotes from the \"Rain Man\" movie.", "Find the lyrics to Eminem's \"Rain Man\"."], ["What is the shelf life of a chicken egg---that is, how old can it be and still be safe to eat?"], ["What is an occupational therapist?", "Find job openings for occupational therapists.", "What are typical salaries for occupational therapists?", "Find information about occupational therapy for a child.", "What are the requirements to become an occupational therapist?"], ["What problems have afflicted the Ford Edge car model?"], ["Find data on how to identify spider bites."], ["Looking for any historical information related to Orcas Island: geographical, buildings, people, infrastructure, etc."], ["What treatments are available for a tooth abscess?", "What are the dangers/complications of leaving a tooth abscess untreated?", "What are the concerns with extracting an abscessed tooth?", "Which antibiotics are used to treat a tooth abscess."], ["Find the causes and risk factors of Barrett's Esophagus.", "What treatments are available for Barrett's Esophagus?", "What is the recommended diet for Barrett's Esophagus?", "Is there a link between Barrett's Esophagus and cancer?", "Find symptoms of Barrett's Esophagus.", "Find pictures of Barrett's Esophagus.", "Find Barret's Esophagus studies performed at the Mayo Clinic."], ["Find information about teddy bear picnics.", "Show me teddy bears made by Gund.", "Find giant teddy bears.", "Locate information about teddy bears by Steiff.", "Where can I buy teddy bears wholesale?"], ["Who is the patron saint of mental illness?"], ["Find summaries of \"Holes\" by Louis Sachar.", "Find lesson plans or classroom activities related to \"Holes\" by Louis Sachar.", "Find reviews of the movie \"Holes\".", "Who are the characters in the book \"Holes\" by Louis Sachar?"], ["Find pictures of a hip roof.", "Find information on hip roof trusses.", "I'm looking for engineering drawings of a hip roof.", "What are the advantages and disadvantages of a hip roof over other roof types?"], ["How do you identify carpenter bees and how are they different from other bees?", "How and where do carpenter bees make their nests?", "How does one get rid of carpenter bees?", "What damage can a carpenter bee do to a home or structure?", "Find a picture of a carpenter bee.", "Do carpenter bees sting?"], ["Find a list of the major battles of the American Revolution.", "Find a time line of the American Revolution.", "Find images of the American Revolution.", "What were the causes of the American revolutionary war?", "What is the history of the American revolutionary war?"], ["What folk remedies are there for soothing a sore throat?"], ["Find cures for baldness (other than hair replacement, hair transplants, or wigs)."], ["What are the current scientific theories of and data on evolution?"], ["Find information about Indian tribes that lived in the area that is now Alabama."], ["What were the ten worst tornadoes in the USA?", "Where is tornado alley?", "What damage can an F5 tornado do?", "Find information on tornado shelters.", "What wind speed defines an F5 tornado?"], ["What are the symptoms of a heart attack in both men and women?"], ["What are the lyrics to the song Feliz Navidad?"], ["How is running beneficial to the health of the human body?"], ["Find information about Marshall County Schools in West Virginia.", "Find the Marshall County Schools in Kentucky school calendar"], ["Find quotes from Sun Tzu.", "Find commentary on Sun Tzu's \"The Art of War\".", "How does Sun Tzu's \"The Art of War\" apply to business?", "Find comparisons of Sun Tzu and Machiavelli.", "What are examples of the philosophy of Sun Tzu?"], ["What activities are good for middle-school-aged children to celebrate Halloween?"], ["Find data on how to generally interpret dreams.", "What do dreams about flying mean?", "What do dreams about water mean?", "What do dreams about teeth mean?", "What do dreams about spiders mean?", "What do dreams about being chased mean?", "What do dreams about death mean?"], ["Find Wilson (Wilson's) Disease Association web site.", "What are the symptoms of Wilson's disease?", "What is the relationship between Wilson's disease and zinc?", "What diet should a person with Wilson's disease follow?", "Find pictures of the Kayser-Fleischer ring that is a sign of Wilson's disease.", "Is there a genetic basis to Wilson's disease?"], ["Find information about golf schools.", "Find vacation packages that include golf instruction.", "What golf instructional videos (DVDs) are available?", "Find online instructions/tips for putting.", "Find lessons on the basics of setup and grip for golf."], ["Find details regarding the casualties of the USS Cole bombing", "Get details on the bombing of the USS Cole.", "What were the results of the investigation of the USS Cole bombing?", "Find the names of the victims of the USS Cole bombing.", "What methods were used for the recovery of the USS Cole?"], ["How has African American music influenced history, including cultural history?"], ["What are the names of the cast members of the television show \"Bewitched\"?", "What are the names of the cast members of the movie \"Bewitched\"?"], ["What are the lyrics to the theme song for \"Mister Rogers' Neighborhood\"?", "Find biographical information for Fred Rogers.", "What characters inhabited Mister Rogers' Neighborhood?", "Find quotes from Mister Rogers.", "Find Mister Rogers videos.", "What songs were sung on \"Mister Rogers' Neighborhood\"?", "Find information about Mister Rogers' Purple Panda."], ["Find books on game theory.", "How did John Nash contribute to game theory?", "What's the timeline for the evolution of game theory?", "How is game theory defined?", "Find seminars, symposia, workshops, and/or courses on game theory.", "What are examples of problems game theory can be used to solve?"], ["How can I find my internet browsing history, i.e., the web sites I have previously visited?"], ["What is a ketogenic diet?", "Find recipes for a ketogenic diet", "What are the side effects of a ketogenic diet?", "How does a ketogenic diet help with epilepsy?", "How does a ketogenic diet help with weight loss?", "Find a ketogenic diet food list."], ["What interplanetary missions has NASA implemented or has planned?"], ["Where can I go on a hay ride in Pennsylvania?"], ["What are the best places to find morel mushrooms growing?"], ["Which foods are rich in magnesium?", "What are the symptoms of a magnesium deficiency?", "What are the effects of too much magnesium?"], ["Which drugs are commonly used to treat the different stages of schizophrenia?"], ["What treatments are available for CCFT, carotid cavernous fistula?"], ["Find quotes from Fidel Castro.", "Find biographical information about Fidel Castro.", "What is the relationship between Ozzie Guillen and Fidel Castro?", "Find information on the health of Fidel Castro.", "Who are Fidel Castro's family members?"], ["What are the benefits of yoga for kids?", "Find information on yoga for seniors.", "Does yoga help with weight loss?", "What are the benefits of various yoga poses?", "What are the benefits of yoga during pregnancy?", "How does yoga benefit runners?", "Find the benefits of yoga nidra."], ["How do you identify a Norway Spruce?", "What are the diseases of the Norway Spruce?", "Find information on planting and growing Norway Spruce trees.", "Find pictures of Norway Spruce trees."], ["What are some cities/destinations within the Sangre de Cristo mountains region?", "What are recreational activities available within the Sangre de Cristo mountains region?", "Find photos of the Sangre de Cristo mountains.", "What are the skiing possibilities in the Sangre de Cristo mountains?", "Is there a pass within the Sangre de Cristo mountain range?", "Find ranches for sale in the Sangre de Cristo mountains area.", "What hiking is available in the Sangre de Cristo mountains?"], ["Find information on how the electronic medical record (or electronic health record) has evolved through the years."], ["What are the educational benefits of social networking sites?"], ["What are the names of some flowering plants?", "What is the definition of a flowering plant?", "Which flowering plants do well in the shade?", "When did flowering plants first appear?", "Find pictures of flowering plants."], ["How do you tie a Windsor knot?"], ["Where can I recycle lead acid batteries?"], ["How can one prevent altitude sickness?", "What is altitude sickness?", "What are the treatments for altitude sickness?", "In which cities is high altitude sickness more likely to occur?"], ["What are the medical or health care practices followed by members of the Jehovah's Witnesses religion?"], ["What is pink slime?", "Who sells ground beef with pink slime in it?", "What restaurants use pink slime?", "Find pictures of pink slime.", "What is ammonia used for in pink slime?", "Is pink slime used in school lunches?"], ["Find a page that explains how to compute the mean of a set of numbers."]]}